Revit 2024 API
LineSegment.StartPoint Property
 Start point of the line segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ StartPoint { get; }
Visual Basic
Public ReadOnly Property StartPoint As XYZ
	Get
Visual C++
public:
property XYZ^ StartPoint {
	XYZ^ get ();
}
See Also
LineSegment Class
Autodesk.Revit.DB Namespace